# SetWorksheetGridLinesVisibility

## Description
Sets the visibility of the grid lines for the specified worksheet.

```pascal
PROCEDURE SetWorksheetGridLinesVisibility(
				h       : HANDLE;
				visible : BOOLEAN);
```

```python
def vs.SetWorksheetGridLinesVisibility(h, visible):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to worksheet.|
|visible|BOOLEAN|The grid line visibility flag.|

## Version
Availability: from Vectorworks 2011

## Category
* Worksheets